Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/svd/PIC32CZ2051CA91176.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="CAN0">
         <name>CAN1</name>
         <baseAddress>0x46060000</baseAddress>
         <interrupt>
            <name>CAN1</name>
            <description>Controller Area Network 1</description>
            <value>195</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="CAN0">
         <name>CAN2</name>
         <baseAddress>0x46062000</baseAddress>
         <interrupt>
            <name>CAN2</name>
            <description>Controller Area Network 2</description>
            <value>196</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="CAN0">
         <name>CAN3</name>
         <baseAddress>0x45860000</baseAddress>
         <interrupt>
            <name>CAN3</name>
            <description>Controller Area Network 3</description>
            <value>197</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="CAN0">
         <name>CAN4</name>
         <baseAddress>0x45062000</baseAddress>
         <interrupt>
            <name>CAN4</name>
            <description>Controller Area Network 4</description>
            <value>198</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="CAN0">
         <name>CAN5</name>
         <baseAddress>0x46860000</baseAddress>
         <interrupt>
            <name>CAN5</name>
            <description>Controller Area Network 5</description>
            <value>199</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>CoreDebug</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Core Debug Register</description>
         <baseAddress>0xE000ED00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DFSR</name>
               <description>Debug Fault Status Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>DHCSR</name>
               <description>Debug Halting Control and Status Register</description>
               <addressOffset>0xF0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>C_DEBUGEN</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C_HALT</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C_STEP</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C_MASKINTS</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C_SNAPSTALL</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_REGRDY</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_HALT</name>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_SLEEP</name>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_LOCKUP</name>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_RETIRE_ST</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_RESET_ST</name>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCRSR</name>
               <description>Debug Core Register Selector Register</description>
               <addressOffset>0xF4</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>REGSEL</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>REGWnR</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCRDR</name>
               <description>Debug Core Register Data Register</description>
               <addressOffset>0xF8</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>DEMCR</name>
               <description>Debug Exception and Monitor Control Register</description>
               <addressOffset>0xFC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VC_CORERESET</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_MMERR</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_NOCPERR</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_CHKERR</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_STATERR</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_BUSERR</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_INTERR</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_HARDERR</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON_EN</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON_PEND</name>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON_STEP</name>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON_REQ</name>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRCENA</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
