Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/svd/PIC32CZ2051CA91176.svd
            <register>
               <name>FRAMECTRL</name>
               <description>SPI Control Frame Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FRMSYPW</name>
                     <description>Frame sync pulse width in serial words</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>FRMSYPWSelect</name>
                        <enumeratedValue>
                           <name>SYPW0</name>
                           <description>Frame sync pulse is one clock wide</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW1</name>
                           <description>Frame sync pulse is one slots wide</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW2</name>
                           <description>Frame sync pulse is two slots wide</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW3</name>
                           <description>Frame sync pulse is three slots wide</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW4</name>
                           <description>Frame sync pulse is four slots wide</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW5</name>
                           <description>Frame sync pulse is five slots wide</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW6</name>
                           <description>Frame sync pulse is six slots wide</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW7</name>
                           <description>Frame sync pulse is seven slots wide</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW8</name>
                           <description>Frame sync pulse is eight slots wide</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW16</name>
                           <description>Frame sync pulse is sixteen slots wide</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYPW31</name>
                           <description>Frame sync pulse is thirty one slots wide</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRMCOINC</name>
                     <description>Frame Sync Pulse Edge Select bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMPOL</name>
                     <description>Frame Sync / Slave Select Polarity bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMSLV</name>
                     <description>Frame Sync Pulse Direction Control bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMCNT</name>
                     <description>Frame sync pulse counter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>FRMCNTSelect</name>
                        <enumeratedValue>
                           <name>CNT1</name>
                           <description>Generate a Frame sync pulse on each serial word</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT2</name>
                           <description>Number of slots per frame sync pulse is 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT3</name>
                           <description>Number of slots per frame sync pulse is 3</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT4</name>
                           <description>Number of slots per frame sync pulse is 4</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT5</name>
                           <description>Number of slots per frame sync pulse is 5</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT6</name>
                           <description>Number of slots per frame sync pulse is 6</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT8</name>
                           <description>Number of slots per frame sync pulse is 8</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT10</name>
                           <description>Number of slots per frame sync pulse is 10</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT12</name>
                           <description>Number of slots per frame sync pulse is 12</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT14</name>
                           <description>Number of slots per frame sync pulse is 14</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT16</name>
                           <description>Number of slots per frame sync pulse is 16</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT18</name>
                           <description>Number of slots per frame sync pulse is 18</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT20</name>
                           <description>Number of slots per frame sync pulse is 20</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT22</name>
                           <description>Number of slots per frame sync pulse is 22</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT24</name>
                           <description>Number of slots per frame sync pulse is 24</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT26</name>
                           <description>Number of slots per frame sync pulse is 26</description>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT28</name>
                           <description>Number of slots per frame sync pulse is 28</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT30</name>
                           <description>Number of slots per frame sync pulse is 30</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNT32</name>
                           <description>Number of slots per frame sync pulse is 32</description>
                           <value>0x12</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDMSSZ</name>
                     <description>TDM Number of Bits in a Slot Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>TDMSSZSelect</name>
                        <enumeratedValue>
                           <name>SLTSZ8</name>
                           <description>Slot Size 8</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLTSZ12</name>
                           <description>Slot Size 12</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLTSZ16</name>
                           <description>Slot Size 16</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLTSZ20</name>
                           <description>Slot Size 20</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLTSZ24</name>
                           <description>Slot Size 24</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLTSZ28</name>
                           <description>Slot Size 28</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLTSZ32</name>
                           <description>Slot Size 32</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDMWSZ</name>
                     <description>TDM Number of Bits in a Word Size</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>TDMWSZSelect</name>
                        <enumeratedValue>
                           <name>WDSZ8</name>
                           <description>Word Size 8</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDSZ12</name>
                           <description>Word Size 12</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDSZ16</name>
                           <description>Word Size 16</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDSZ20</name>
                           <description>Word Size 20</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDSZ24</name>
                           <description>Word Size 24</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDSZ28</name>
                           <description>Word Size 28</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDSZ32</name>
                           <description>Word Size 32</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUDCTRL</name>
               <description>SPI Control Audio Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AUDMOD</name>
                     <description>Audio Protocol Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>AUDMODSelect</name>
                        <enumeratedValue>
                           <name>STDMODE</name>
                           <description>I2S/I8S Standard Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LJRJMODE</name>
                           <description>I2S/I8S Left Or Right Justified</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PCMMODE</name>
                           <description>PCM/DSP Mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUDMONO</name>
                     <description>Transmit audio data format</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUDFMT</name>
                     <description>Audio Protocol Format</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>AUDFMTSelect</name>
                        <enumeratedValue>
                           <name>I2SLEGACY</name>
                           <description>Legacy I2S Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2SRAW</name>
                           <description>I2S Raw Audio Format</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2SOTHER824</name>
                           <description>I2S Other AM824 Format</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I8SOTHER</name>
                           <description>I8S Other Format</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I8SRAW</name>
                           <description>I8S Raw Audio Format</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I8SOTHER824</name>
                           <description>I8S Other AM824 Format</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUDWDMODE</name>
                     <description>Serial Word Length bits (Ignored when AUDEN=0)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPDCTRL</name>
               <description>SPI Control Tpd Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PKFMT</name>
                     <description>Master Slave TPD mode.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PKFMTSelect</name>
                        <enumeratedValue>
                           <name>PKT4x32</name>
                           <description>32 bit data in 4x32 packed format</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PKT3x32</name>
                           <description>32 bit data in 3x32 packed format</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PKT4x24</name>
                           <description>24 bit data in 4x24 packed format</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PKT3x24</name>
                           <description>24 bit data in 3x24 packed format</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PKT6x16</name>
                           <description>16 bit data in 6x16 packed format</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PKT4x16</name>
                           <description>16 bit data in 4x16 packed format</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PKT2x16</name>
                           <description>16 bit data in 2x16 packed format</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLVNUM</name>
                     <description>Number of the Slave designated: to be used with the PKFMT to determine the slave.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SLVNUMSelect</name>
                        <enumeratedValue>
                           <name>SLAVE0</name>
                           <description>SLAVE 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLAVE1</name>
                           <description>SLAVE 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLAVE2</name>
                           <description>SLAVE 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLAVE3</name>
                           <description>SLAVE 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLAVE4</name>
                           <description>SLAVE 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
