Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/svd/PIC32CZ2051CA91176.svd
            <register>
               <name>VREFCTRL</name>
               <description>VREF Control</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>LPSTDBY</name>
                     <description>Bandgap and Regulators Low Power Standby Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPSTDBYSelect</name>
                        <enumeratedValue>
                           <name>FullPower</name>
                           <description>In standby mode, bandgap and enabled regulator(s) are set to nominal power mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LowPower</name>
                           <description>In standby mode, bandgap and enabled regulator(s) are set to low power mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPHIB</name>
                     <description>Bandgap and Regulators Low Power Hibernate Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPHIBSelect</name>
                        <enumeratedValue>
                           <name>FullPower</name>
                           <description>In hibernate mode, bandgap is set to nominal power mode. As a consequence, enabled regulator(s) are set to nominal power mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LowPower</name>
                           <description>In hibernate mode, bandgap is set to low power mode. As a consequence, enabled regulator(s) are set to low power mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSEN</name>
                     <description>Temperature Sensor Output Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKOUT</name>
               <description>Backup Output Control</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN0</name>
                     <description>Enable Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN1</name>
                     <description>Enable Output</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLR0</name>
                     <description>Clear Output</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLR1</name>
                     <description>Clear Output</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SET0</name>
                     <description>Set Output</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SET1</name>
                     <description>Set Output</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TGLOM0</name>
                     <description>Toggle Output Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TGLOM0Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The output does not toggle.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RTCTGL</name>
                           <description>The output toggles on RTC event.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BKUPTGL</name>
                           <description>The output is set when the device enters backup mode or battery backup mode. The output should then be cleared by software.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TGLOM1</name>
                     <description>Toggle Output Mode</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TGLOM1Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The output does not toggle.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RTCTGL</name>
                           <description>The output toggles on RTC event.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BKUPTGL</name>
                           <description>The output is set when the device enters backup mode or battery backup mode. The output should then be cleared by software.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKIN</name>
               <description>Backup Input Control</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKIN</name>
                     <description>Backup Input Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
