Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/svd/PIC32CZ2051CA91176.svd
                  <register>
                     <name>DMAADDR</name>
                     <description>Memory Address Of The Corresponding DMA Channel</description>
                     <addressOffset>0x4</addressOffset>
                     <size>32</size>
                     <resetValue>0x00000000</resetValue>
                     <fields>
                        <field>
                           <name>ADDR10</name>
                           <description>Lower 2 bits of DMA memory address</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>2</bitWidth>
                        </field>
                        <field>
                           <name>ADDR312</name>
                           <description>upper 30 bits of address</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>30</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>DMACOUNT</name>
                     <description>Current DMA Count Of The Transfer</description>
                     <addressOffset>0x8</addressOffset>
                     <size>32</size>
                     <resetValue>0x00000000</resetValue>
                     <fields>
                        <field>
                           <name>DMACOUNT</name>
                           <description>current dma count of the transfer</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>32</bitWidth>
                        </field>
                     </fields>
                  </register>
               </cluster>
               <register>
                  <dim>7</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>RQPKTCOUNT[%s]</name>
                  <description>Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer</description>
                  <addressOffset>0x1304</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>RQPKTCOUNT</name>
                        <description>sets the number of packets of size maxp that are to be transferred in a block transfer. only used in host mode when autoreq is set. has no effect in peripheral mode or when autoreq is not set.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXDPKTBUFDIS</name>
                  <description>Indicates Which Of The RX Endpoints Have Disabled Double Packet Buffer Functionality</description>
                  <addressOffset>0x1340</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>EPxRXDIS</name>
                        <description>each bit indicates which of the Rx endpoint have disabled double buffer functionality</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>15</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXDPKTBUFDIS</name>
                  <description>Indicates Which Of The TX Endpoints Have Disabled Double Packet Buffer Functionality</description>
                  <addressOffset>0x1342</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>EPxTXDIS</name>
                        <description>each bit indicates which of the Tx endpoint have disabled double buffer functionality</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>15</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTUCH</name>
                  <description>Chirp Timeout. Number Of XCLK Cycles Before The Timeout</description>
                  <addressOffset>0x1344</addressOffset>
                  <size>16</size>
                  <resetValue>0x4074</resetValue>
                  <fields>
                     <field>
                        <name>CTUCH</name>
                        <description>this number when multiplied by 4 represents the number of xclk cycles before the timeout occurs</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTHHSRTN</name>
                  <description>Sets The Delay From The End Of High-Speed Resume Signaling (Acting As A Host) To Enable The UTM Normal Operating Mode</description>
                  <addressOffset>0x1346</addressOffset>
                  <size>16</size>
                  <resetValue>0x0032</resetValue>
                  <fields>
                     <field>
                        <name>CTHHSRTN</name>
                        <description>the delay from the end of high speed resume signaling to enabling utm normal operating mode.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTHSBT</name>
                  <description>This Register Represents The Value To Be Added To The Minimum High Speed Timeout Period Of 736 Bit Times.</description>
                  <addressOffset>0x1348</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>HSTMEOUTADD</name>
                        <description>this register represents the value to be added to the mimumum high speed timeout period of 736 bit times</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMATTR</name>
                  <description>Defines The Attributes Of An LPM Transaction And Sleep Cycle.</description>
                  <addressOffset>0x1360</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>LINKSTATE</name>
                        <description>this value is provided by the host to the peripheral to indicate what state the peripheral must transition to after the receipt and acceptance of a lpm transaction.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>LINKSTATESelect</name>
                           <enumeratedValue>
                              <name>SLEEPSTATE</name>
                              <description>Sleep State (L1)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>HIRD</name>
                        <description>this is the host initiated resume duration.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RMTWAK</name>
                        <description>this bit is the remote wakeup enable bit.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENDPOINT</name>
                        <description>this is the endpnt that in the token packet of the lpm transaction.</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMCNTRL_HOST_MODE</name>
                  <description>LPM Control Register</description>
                  <addressOffset>0x1362</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMXMT</name>
                        <description>software should set this bit to transmit an lpm transaction.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRES</name>
                        <description>this bit is used by software to initiate a resume from the l1 state</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMCNTRL_PERIPHERAL_MODE</name>
                  <description>LPM Control Register</description>
                  <alternateRegister>LPMCNTRL_HOST_MODE</alternateRegister>
                  <addressOffset>0x1362</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMXMT</name>
                        <description>this bit is set by software to instruct the core to transition to the l1 state upon the receipt of the next lpm transaction.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRES</name>
                        <description>this bit is used by software to initiate resume (remote wakeup).</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMEN</name>
                        <description>this register is used to enable lpm in the musbmhdrc.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LPMENSelect</name>
                           <enumeratedValue>
                              <name>LPMTRANS</name>
                              <description>Core supports LPM extended transactions</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EXTNTRANS</name>
                              <description>LPM is not supported but extended transactions are supported.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NOTSUPPORTED1</name>
                              <description>LPM and extended transactions are not supported</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NOTSUPPORTED2</name>
                              <description>LPM and extended transactions are not supported</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LPMNAK</name>
                        <description>this bit is used to place all end points in a state such that the response to all transactions other then an lpm transaction will be a nak.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMINTREN</name>
                  <description>LPM Interrupts Enable Register</description>
                  <addressOffset>0x1363</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMSTEN</name>
                        <description>LPMMST interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNYEN</name>
                        <description>LPMMNY interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMACKEN</name>
                        <description>LPMACK interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNCEN</name>
                        <description>LPMNC interrupt</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRESEN</name>
                        <description>LPMRES interrupt</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMERREN</name>
                        <description>LPMERR interrupt</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMINTR_HOST_MODE</name>
                  <description>Status Of The LPM Power State</description>
                  <addressOffset>0x1364</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMST</name>
                        <description>this bit is set when an lpm transaction is transmitted and the device responds with a stall.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNY</name>
                        <description>this bit is set when an lpm transaction is transmitted and the device responds with a nyet.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMACK</name>
                        <description>this bit is set when an lpm transaction is transmitted and the device responds with an ack.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNC</name>
                        <description>this bit is set when an lpm transaction has been transmitted and has failed to complete.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRES</name>
                        <description>this bit is set when the core has been resumed for any reason.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMERR</name>
                        <description>this bit is set if a response to the lpm transaction is received with a bit stuff error or a pid error</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMINTR_PERIPHERAL_MODE</name>
                  <description>Status Of The LPM Power State</description>
                  <alternateRegister>LPMINTR_HOST_MODE</alternateRegister>
                  <addressOffset>0x1364</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMST</name>
                        <description>this bit is set when an lpm transaction is received and the core responds with a stall.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNY</name>
                        <description>this bit is set when an lpm transaction is received and the core responds with a nyet</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMACK</name>
                        <description>this bit is set when an lpm transaction is received and the core responds with an ack.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNC</name>
                        <description>this bit is set when an lpm transaction is received and the core responds with a nyet due to data pending in the rx fifos.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRES</name>
                        <description>this bit is set if the core has been resumed for any reason.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMERR</name>
                        <description>this bit is set if an lpm transaction is received that has a linkstate field that is not supported</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMFADDR</name>
                  <description>Function Address In LPM Payload</description>
                  <addressOffset>0x1365</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>FUNCADDR</name>
                        <description>function address that will be placed in the LPM payload</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
